Merge pull request #2 from Venkatasai-018/eks-tf
Eks tf code
